{"keras_version": "1.2.1", "config": [{"config": {"function_type": "lambda", "batch_input_shape": [null, 128, 128, 3], "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-1-1b04da9b8f7e>\u00da\b<lambda>\u0081\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "trainable": true}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 24, "name": "convolution2d_1", "nb_col": 5, "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.1}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 36, "name": "convolution2d_2", "nb_col": 5, "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 48, "name": "convolution2d_3", "nb_col": 5, "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 64, "name": "convolution2d_4", "nb_col": 3, "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4", "border_mode": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 64, "name": "convolution2d_5", "nb_col": 3, "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_5", "border_mode": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.3}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 1024, "name": "dense_1", "output_dim": 500, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.4}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 500, "name": "dense_2", "output_dim": 100, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.2}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 100, "name": "dense_3", "output_dim": 50, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 50, "name": "dense_4", "output_dim": 10, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 10, "name": "dense_5", "output_dim": 1, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}